Andi-Pleian/Crash_Detection_Monitoring_Over_XCP/TC3x7_XCP/EB_Stubs/Os_tc39xx.h
/* Os_tc39xx.h - Description of Tricore TC39XX (Aurix development vehicle)
 *
 * CHECK: TABS 4 (see editor commands at end of file)
 *
 * Copyright Elektrobit Automotive GmbH
 * All rights exclusively reserved for Elektrobit Automotive GmbH,
 * unless expressly agreed to otherwise.
 *
 * $Id: Os_tc39xx.h 1.1 2017/12/21 16:34:56CET Postolache, Alexandru (uidu6496) none  $
*/

/*	This file describes the TC39XX variant of Tricore.
*/

#ifndef OS_TC39XX_H
#define OS_TC39XX_H

/*	Setup architecture */

#define OS_TRICOREARCH	OS_TRICOREARCH_162

/* number of cores available on this derivative */
#define OS_N_CORES_MAX				6

/*	Tricore CPU Core SFRs
*/
#include <TRICORE/Os_TRICORE_core.h>

/* Start adress of physical address space */
#define OS_PHYS_ADDR_SPACE_START	OS_U(0x10000000)

/* Base addresses for the memory mapped CSFRs needed for StartCore()
 * 
 * Core 0: F881 0000
 * Core 1: F883 0000
 * Core 2: F885 0000
 * Core 3: F887 0000
 * Core 4: F889 0000
 * Core 5: F88D 0000 (!)
 *
 * */
#define OS_CPUCSFR(coreid) \
	(((coreid)<5) ? (OS_U(0xF8810000) + ((coreid)*OS_U(0x20000))) : OS_U(0xF88D0000))

/* Core-specific physical memory attributes for data(PMA0)/instruction(PMA1) cache enabled/disabled
 *
 * The TC1.6.2 cores have true caches, which we cannot use for writeable memories since there is
 * no way to achieve cache coherency (in an atomic fashion).
 *
 * PMA values:
 * Segment:  fedc ba98 7654 3210
 *           0000 0011 0000 0000 - 0x0300 - cached access on segments which are cached by default.
 */
#define OS_PMA0_CACHEENABLED(coreid) OS_U(0x0300)
#define OS_PMA0_CACHEDISABLED(coreid) OS_U(0x0300)
#define OS_PMA1_CACHEENABLED(coreid) OS_PMA0_CACHEENABLED(coreid)
#define OS_PMA1_CACHEDISABLED(coreid) OS_U(0x0300)
#define PCON0_CACHE_BYPASS OS_U(0x2)
#define DCON0_CACHE_BYPASS OS_U(0x2)

/* Memory protection registers don't have lower 3 bits in Aurix
*/
#define OS_DPRX_GRANULARITY_BITS	3u

/* 
 * This list is derived from the A-step target specification.
 */

#define OS_SRCBASE  OS_U(0xf0038000)

#define OS_SRC_CPU0SB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0000))
#define OS_SRC_CPU1SB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0004))
#define OS_SRC_CPU2SB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0008))
#define OS_SRC_CPU3SB (*(os_tricoresrn_t *)(OS_SRCBASE+0x000C))
#define OS_SRC_CPU4SB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0010))
#define OS_SRC_CPU5SB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0014))
#define OS_SRC_BCUSPB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0020))
#define OS_SRC_BCUBBB (*(os_tricoresrn_t *)(OS_SRCBASE+0x0024))
#define OS_SRC_AGBT (*(os_tricoresrn_t *)(OS_SRCBASE+0x002C))
#define OS_SRC_XBAR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0030))
#define OS_SRC_XBAR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0034))
#define OS_SRC_XBAR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0038))
#define OS_SRC_CERBERUS0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0040))
#define OS_SRC_CERBERUS1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0044))
#define OS_SRC_ASCLIN0TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0050))
#define OS_SRC_ASCLIN1TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x005C))
#define OS_SRC_ASCLIN2TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0068))
#define OS_SRC_ASCLIN3TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0074))
#define OS_SRC_ASCLIN4TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0080))
#define OS_SRC_ASCLIN5TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x008C))
#define OS_SRC_ASCLIN6TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0098))
#define OS_SRC_ASCLIN7TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00A4))
#define OS_SRC_ASCLIN0RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0054))
#define OS_SRC_ASCLIN1RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0060))
#define OS_SRC_ASCLIN2RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x006C))
#define OS_SRC_ASCLIN3RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0078))
#define OS_SRC_ASCLIN4RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0084))
#define OS_SRC_ASCLIN5RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0090))
#define OS_SRC_ASCLIN6RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x009C))
#define OS_SRC_ASCLIN7RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00A8))
#define OS_SRC_ASCLIN0ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0058))
#define OS_SRC_ASCLIN1ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0064))
#define OS_SRC_ASCLIN2ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0070))
#define OS_SRC_ASCLIN3ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x007C))
#define OS_SRC_ASCLIN4ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0088))
#define OS_SRC_ASCLIN5ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0094))
#define OS_SRC_ASCLIN6ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x00A0))
#define OS_SRC_ASCLIN7ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x00AC))
#define OS_SRC_MTUDONE (*(os_tricoresrn_t *)(OS_SRCBASE+0x00BC))
#define OS_SRC_QSPI0TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00C0))
#define OS_SRC_QSPI1TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00D4))
#define OS_SRC_QSPI2TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00E8))
#define OS_SRC_QSPI3TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00FC))
#define OS_SRC_QSPI4TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0110))
#define OS_SRC_QSPI5TX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0124))
#define OS_SRC_QSPI0RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00C4))
#define OS_SRC_QSPI1RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00D8))
#define OS_SRC_QSPI2RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x00EC))
#define OS_SRC_QSPI3RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0100))
#define OS_SRC_QSPI4RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0114))
#define OS_SRC_QSPI5RX (*(os_tricoresrn_t *)(OS_SRCBASE+0x0128))
#define OS_SRC_QSPI0ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x00C8))
#define OS_SRC_QSPI1ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x00DC))
#define OS_SRC_QSPI2ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x00F0))
#define OS_SRC_QSPI3ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0104))
#define OS_SRC_QSPI4ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0118))
#define OS_SRC_QSPI5ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x012C))
#define OS_SRC_QSPI0PT (*(os_tricoresrn_t *)(OS_SRCBASE+0x00CC))
#define OS_SRC_QSPI1PT (*(os_tricoresrn_t *)(OS_SRCBASE+0x00E0))
#define OS_SRC_QSPI2PT (*(os_tricoresrn_t *)(OS_SRCBASE+0x00F4))
#define OS_SRC_QSPI3PT (*(os_tricoresrn_t *)(OS_SRCBASE+0x0108))
#define OS_SRC_QSPI4PT (*(os_tricoresrn_t *)(OS_SRCBASE+0x011C))
#define OS_SRC_QSPI5PT (*(os_tricoresrn_t *)(OS_SRCBASE+0x0130))
#define OS_SRC_QSPI0U (*(os_tricoresrn_t *)(OS_SRCBASE+0x00D0))
#define OS_SRC_QSPI1U (*(os_tricoresrn_t *)(OS_SRCBASE+0x00E4))
#define OS_SRC_QSPI2U (*(os_tricoresrn_t *)(OS_SRCBASE+0x00F8))
#define OS_SRC_QSPI3U (*(os_tricoresrn_t *)(OS_SRCBASE+0x010C))
#define OS_SRC_QSPI4U (*(os_tricoresrn_t *)(OS_SRCBASE+0x0120))
#define OS_SRC_QSPI5U (*(os_tricoresrn_t *)(OS_SRCBASE+0x0134))
#define OS_SRC_QSPI2HC (*(os_tricoresrn_t *)(OS_SRCBASE+0x0158))
#define OS_SRC_QSPI3HC (*(os_tricoresrn_t *)(OS_SRCBASE+0x015C))
#define OS_SRC_HSCT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0160))
#define OS_SRC_HSCT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0164))
#define OS_SRC_HSSL0COK0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0170))
#define OS_SRC_HSSL0COK1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0180))
#define OS_SRC_HSSL0COK2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0190))
#define OS_SRC_HSSL0COK3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01A0))
#define OS_SRC_HSSL0RDI0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0174))
#define OS_SRC_HSSL0RDI1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0184))
#define OS_SRC_HSSL0RDI2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0194))
#define OS_SRC_HSSL0RDI3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01A4))
#define OS_SRC_HSSL0ERR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0178))
#define OS_SRC_HSSL0ERR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0188))
#define OS_SRC_HSSL0ERR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0198))
#define OS_SRC_HSSL0ERR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01A8))
#define OS_SRC_HSSL0TRG0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x017C))
#define OS_SRC_HSSL0TRG1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x018C))
#define OS_SRC_HSSL0TRG2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x019C))
#define OS_SRC_HSSL0TRG3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01AC))
#define OS_SRC_HSSL0EXI (*(os_tricoresrn_t *)(OS_SRCBASE+0x01B0))
#define OS_SRC_HSSL1COK0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01B4))
#define OS_SRC_HSSL1COK1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01C4))
#define OS_SRC_HSSL1COK2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01D4))
#define OS_SRC_HSSL1COK3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01E4))
#define OS_SRC_HSSL1RDI0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01B8))
#define OS_SRC_HSSL1RDI1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01C8))
#define OS_SRC_HSSL1RDI2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01D8))
#define OS_SRC_HSSL1RDI3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01E8))
#define OS_SRC_HSSL1ERR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01BC))
#define OS_SRC_HSSL1ERR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01CC))
#define OS_SRC_HSSL1ERR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01DC))
#define OS_SRC_HSSL1ERR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01EC))
#define OS_SRC_HSSL1TRG0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01C0))
#define OS_SRC_HSSL1TRG1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01D0))
#define OS_SRC_HSSL1TRG2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01E0))
#define OS_SRC_HSSL1TRG3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x01F0))
#define OS_SRC_HSSL1EXI (*(os_tricoresrn_t *)(OS_SRCBASE+0x01F4))
#define OS_SRC_I2C0DTR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0200))
#define OS_SRC_I2C0ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0204))
#define OS_SRC_I2C0P (*(os_tricoresrn_t *)(OS_SRCBASE+0x0208))
#define OS_SRC_I2C1DTR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0210))
#define OS_SRC_I2C1ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0214))
#define OS_SRC_I2C1P (*(os_tricoresrn_t *)(OS_SRCBASE+0x0218))
#define OS_SRC_SENT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0220))
#define OS_SRC_SENT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0224))
#define OS_SRC_SENT2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0228))
#define OS_SRC_SENT3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x022C))
#define OS_SRC_SENT4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0230))
#define OS_SRC_SENT5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0234))
#define OS_SRC_SENT6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0238))
#define OS_SRC_SENT7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x023C))
#define OS_SRC_SENT8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0240))
#define OS_SRC_SENT9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0244))
#define OS_SRC_MSC0SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0250))
#define OS_SRC_MSC1SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0264))
#define OS_SRC_MSC2SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0278))
#define OS_SRC_MSC3SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x028C))
#define OS_SRC_MSC0SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0254))
#define OS_SRC_MSC1SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0268))
#define OS_SRC_MSC2SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x027C))
#define OS_SRC_MSC3SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0290))
#define OS_SRC_MSC0SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0258))
#define OS_SRC_MSC1SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x026C))
#define OS_SRC_MSC2SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0280))
#define OS_SRC_MSC3SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0294))
#define OS_SRC_MSC0SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x025C))
#define OS_SRC_MSC1SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0270))
#define OS_SRC_MSC2SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0284))
#define OS_SRC_MSC3SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0298))
#define OS_SRC_MSC0SR4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0260))
#define OS_SRC_MSC1SR4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0274))
#define OS_SRC_MSC2SR4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0288))
#define OS_SRC_MSC3SR4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x029C))
#define OS_SRC_CCU60SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02A0))
#define OS_SRC_CCU61SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02B0))
#define OS_SRC_CCU60SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02A4))
#define OS_SRC_CCU61SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02B4))
#define OS_SRC_CCU60SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02A8))
#define OS_SRC_CCU61SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02B8))
#define OS_SRC_CCU60SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02AC))
#define OS_SRC_CCU61SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02BC))
#define OS_SRC_GPT120CIRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x02E0))
#define OS_SRC_GPT120T2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02E4))
#define OS_SRC_GPT120T3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02E8))
#define OS_SRC_GPT120T4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02EC))
#define OS_SRC_GPT120T5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02F0))
#define OS_SRC_GPT120T6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x02F4))
#define OS_SRC_STM0SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0300))
#define OS_SRC_STM1SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0308))
#define OS_SRC_STM2SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0310))
#define OS_SRC_STM3SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0318))
#define OS_SRC_STM4SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0320))
#define OS_SRC_STM5SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0328))
#define OS_SRC_STM0SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0304))
#define OS_SRC_STM1SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x030C))
#define OS_SRC_STM2SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0314))
#define OS_SRC_STM3SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x031C))
#define OS_SRC_STM4SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0324))
#define OS_SRC_STM5SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x032C))
#define OS_SRC_FCE0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0330))
#define OS_SRC_DMAERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0340))
#define OS_SRC_DMACH0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0350))
#define OS_SRC_DMACH1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0354))
#define OS_SRC_DMACH2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0358))
#define OS_SRC_DMACH3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x035C))
#define OS_SRC_DMACH4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0360))
#define OS_SRC_DMACH5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0364))
#define OS_SRC_DMACH6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0368))
#define OS_SRC_DMACH7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x036C))
#define OS_SRC_DMACH8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0370))
#define OS_SRC_DMACH9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0374))
#define OS_SRC_DMACH10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0378))
#define OS_SRC_DMACH11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x037C))
#define OS_SRC_DMACH12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0380))
#define OS_SRC_DMACH13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0384))
#define OS_SRC_DMACH14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0388))
#define OS_SRC_DMACH15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x038C))
#define OS_SRC_DMACH16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0390))
#define OS_SRC_DMACH17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0394))
#define OS_SRC_DMACH18 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0398))
#define OS_SRC_DMACH19 (*(os_tricoresrn_t *)(OS_SRCBASE+0x039C))
#define OS_SRC_DMACH20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03A0))
#define OS_SRC_DMACH21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03A4))
#define OS_SRC_DMACH22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03A8))
#define OS_SRC_DMACH23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03AC))
#define OS_SRC_DMACH24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03B0))
#define OS_SRC_DMACH25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03B4))
#define OS_SRC_DMACH26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03B8))
#define OS_SRC_DMACH27 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03BC))
#define OS_SRC_DMACH28 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03C0))
#define OS_SRC_DMACH29 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03C4))
#define OS_SRC_DMACH30 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03C8))
#define OS_SRC_DMACH31 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03CC))
#define OS_SRC_DMACH32 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03D0))
#define OS_SRC_DMACH33 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03D4))
#define OS_SRC_DMACH34 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03D8))
#define OS_SRC_DMACH35 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03DC))
#define OS_SRC_DMACH36 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03E0))
#define OS_SRC_DMACH37 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03E4))
#define OS_SRC_DMACH38 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03E8))
#define OS_SRC_DMACH39 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03EC))
#define OS_SRC_DMACH40 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03F0))
#define OS_SRC_DMACH41 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03F4))
#define OS_SRC_DMACH42 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03F8))
#define OS_SRC_DMACH43 (*(os_tricoresrn_t *)(OS_SRCBASE+0x03FC))
#define OS_SRC_DMACH44 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0400))
#define OS_SRC_DMACH45 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0404))
#define OS_SRC_DMACH46 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0408))
#define OS_SRC_DMACH47 (*(os_tricoresrn_t *)(OS_SRCBASE+0x040C))
#define OS_SRC_DMACH48 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0410))
#define OS_SRC_DMACH49 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0414))
#define OS_SRC_DMACH50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0418))
#define OS_SRC_DMACH51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x041C))
#define OS_SRC_DMACH52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0420))
#define OS_SRC_DMACH53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0424))
#define OS_SRC_DMACH54 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0428))
#define OS_SRC_DMACH55 (*(os_tricoresrn_t *)(OS_SRCBASE+0x042C))
#define OS_SRC_DMACH56 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0430))
#define OS_SRC_DMACH57 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0434))
#define OS_SRC_DMACH58 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0438))
#define OS_SRC_DMACH59 (*(os_tricoresrn_t *)(OS_SRCBASE+0x043C))
#define OS_SRC_DMACH60 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0440))
#define OS_SRC_DMACH61 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0444))
#define OS_SRC_DMACH62 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0448))
#define OS_SRC_DMACH63 (*(os_tricoresrn_t *)(OS_SRCBASE+0x044C))
#define OS_SRC_DMACH64 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0450))
#define OS_SRC_DMACH65 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0454))
#define OS_SRC_DMACH66 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0458))
#define OS_SRC_DMACH67 (*(os_tricoresrn_t *)(OS_SRCBASE+0x045C))
#define OS_SRC_DMACH68 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0460))
#define OS_SRC_DMACH69 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0464))
#define OS_SRC_DMACH70 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0468))
#define OS_SRC_DMACH71 (*(os_tricoresrn_t *)(OS_SRCBASE+0x046C))
#define OS_SRC_DMACH72 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0470))
#define OS_SRC_DMACH73 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0474))
#define OS_SRC_DMACH74 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0478))
#define OS_SRC_DMACH75 (*(os_tricoresrn_t *)(OS_SRCBASE+0x047C))
#define OS_SRC_DMACH76 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0480))
#define OS_SRC_DMACH77 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0484))
#define OS_SRC_DMACH78 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0488))
#define OS_SRC_DMACH79 (*(os_tricoresrn_t *)(OS_SRCBASE+0x048C))
#define OS_SRC_DMACH80 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0490))
#define OS_SRC_DMACH81 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0494))
#define OS_SRC_DMACH82 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0498))
#define OS_SRC_DMACH83 (*(os_tricoresrn_t *)(OS_SRCBASE+0x049C))
#define OS_SRC_DMACH84 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04A0))
#define OS_SRC_DMACH85 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04A4))
#define OS_SRC_DMACH86 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04A8))
#define OS_SRC_DMACH87 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04AC))
#define OS_SRC_DMACH88 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04B0))
#define OS_SRC_DMACH89 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04B4))
#define OS_SRC_DMACH90 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04B8))
#define OS_SRC_DMACH91 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04BC))
#define OS_SRC_DMACH92 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04C0))
#define OS_SRC_DMACH93 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04C4))
#define OS_SRC_DMACH94 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04C8))
#define OS_SRC_DMACH95 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04CC))
#define OS_SRC_DMACH96 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04D0))
#define OS_SRC_DMACH97 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04D4))
#define OS_SRC_DMACH98 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04D8))
#define OS_SRC_DMACH99 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04DC))
#define OS_SRC_DMACH100 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04E0))
#define OS_SRC_DMACH101 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04E4))
#define OS_SRC_DMACH102 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04E8))
#define OS_SRC_DMACH103 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04EC))
#define OS_SRC_DMACH104 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04F0))
#define OS_SRC_DMACH105 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04F4))
#define OS_SRC_DMACH106 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04F8))
#define OS_SRC_DMACH107 (*(os_tricoresrn_t *)(OS_SRCBASE+0x04FC))
#define OS_SRC_DMACH108 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0500))
#define OS_SRC_DMACH109 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0504))
#define OS_SRC_DMACH110 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0508))
#define OS_SRC_DMACH111 (*(os_tricoresrn_t *)(OS_SRCBASE+0x050C))
#define OS_SRC_DMACH112 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0510))
#define OS_SRC_DMACH113 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0514))
#define OS_SRC_DMACH114 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0518))
#define OS_SRC_DMACH115 (*(os_tricoresrn_t *)(OS_SRCBASE+0x051C))
#define OS_SRC_DMACH116 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0520))
#define OS_SRC_DMACH117 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0524))
#define OS_SRC_DMACH118 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0528))
#define OS_SRC_DMACH119 (*(os_tricoresrn_t *)(OS_SRCBASE+0x052C))
#define OS_SRC_DMACH120 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0530))
#define OS_SRC_DMACH121 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0534))
#define OS_SRC_DMACH122 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0538))
#define OS_SRC_DMACH123 (*(os_tricoresrn_t *)(OS_SRCBASE+0x053C))
#define OS_SRC_DMACH124 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0540))
#define OS_SRC_DMACH125 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0544))
#define OS_SRC_DMACH126 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0548))
#define OS_SRC_DMACH127 (*(os_tricoresrn_t *)(OS_SRCBASE+0x054C))
#define OS_SRC_PDMAERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0550))
#define OS_SRC_PDMARDY (*(os_tricoresrn_t *)(OS_SRCBASE+0x0554))
#define OS_SRC_ETH (*(os_tricoresrn_t *)(OS_SRCBASE+0x0560))
#define OS_SRC_CAN0INT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0580))
#define OS_SRC_CAN0INT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0584))
#define OS_SRC_CAN0INT2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0588))
#define OS_SRC_CAN0INT3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x058C))
#define OS_SRC_CAN0INT4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0590))
#define OS_SRC_CAN0INT5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0594))
#define OS_SRC_CAN0INT6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0598))
#define OS_SRC_CAN0INT7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x059C))
#define OS_SRC_CAN0INT8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05A0))
#define OS_SRC_CAN0INT9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05A4))
#define OS_SRC_CAN0INT10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05A8))
#define OS_SRC_CAN0INT11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05AC))
#define OS_SRC_CAN0INT12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05B0))
#define OS_SRC_CAN0INT13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05B4))
#define OS_SRC_CAN0INT14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05B8))
#define OS_SRC_CAN0INT15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05BC))
#define OS_SRC_CAN1INT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05C0))
#define OS_SRC_CAN1INT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05C4))
#define OS_SRC_CAN1INT2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05C8))
#define OS_SRC_CAN1INT3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05CC))
#define OS_SRC_CAN1INT4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05D0))
#define OS_SRC_CAN1INT5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05D4))
#define OS_SRC_CAN1INT6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05D8))
#define OS_SRC_CAN1INT7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05DC))
#define OS_SRC_CAN1INT8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05E0))
#define OS_SRC_CAN1INT9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05E4))
#define OS_SRC_CAN1INT10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05E8))
#define OS_SRC_CAN1INT11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05EC))
#define OS_SRC_CAN1INT12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05F0))
#define OS_SRC_CAN1INT13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05F4))
#define OS_SRC_CAN1INT14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05F8))
#define OS_SRC_CAN1INT15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x05FC))
#define OS_SRC_CAN2INT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0600))
