Andi-Pleian/Crash_Detection_Monitoring_Over_XCP/TC3x7_XCP/EB_Stubs/Os_tc39xx.h
#define OS_SRC_CAN2INT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0604))
#define OS_SRC_CAN2INT2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0608))
#define OS_SRC_CAN2INT3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x060C))
#define OS_SRC_CAN2INT4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0610))
#define OS_SRC_CAN2INT5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0614))
#define OS_SRC_CAN2INT6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0618))
#define OS_SRC_CAN2INT7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x061C))
#define OS_SRC_CAN2INT8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0620))
#define OS_SRC_CAN2INT9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0624))
#define OS_SRC_CAN2INT10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0628))
#define OS_SRC_CAN2INT11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x062C))
#define OS_SRC_CAN2INT12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0630))
#define OS_SRC_CAN2INT13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0634))
#define OS_SRC_CAN2INT14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0638))
#define OS_SRC_CAN2INT15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x063C))
#define OS_SRC_VADCG0SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0670))
#define OS_SRC_VADCG0SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0674))
#define OS_SRC_VADCG0SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0678))
#define OS_SRC_VADCG0SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x067C))
#define OS_SRC_VADCG1SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0680))
#define OS_SRC_VADCG1SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0684))
#define OS_SRC_VADCG1SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0688))
#define OS_SRC_VADCG1SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x068C))
#define OS_SRC_VADCG2SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0690))
#define OS_SRC_VADCG2SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0694))
#define OS_SRC_VADCG2SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0698))
#define OS_SRC_VADCG2SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x069C))
#define OS_SRC_VADCG3SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06A0))
#define OS_SRC_VADCG3SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06A4))
#define OS_SRC_VADCG3SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06A8))
#define OS_SRC_VADCG3SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06AC))
#define OS_SRC_VADCG4SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06B0))
#define OS_SRC_VADCG4SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06B4))
#define OS_SRC_VADCG4SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06B8))
#define OS_SRC_VADCG4SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06BC))
#define OS_SRC_VADCG5SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06C0))
#define OS_SRC_VADCG5SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06C4))
#define OS_SRC_VADCG5SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06C8))
#define OS_SRC_VADCG5SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06CC))
#define OS_SRC_VADCG6SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06D0))
#define OS_SRC_VADCG6SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06D4))
#define OS_SRC_VADCG6SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06D8))
#define OS_SRC_VADCG6SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06DC))
#define OS_SRC_VADCG7SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06E0))
#define OS_SRC_VADCG7SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06E4))
#define OS_SRC_VADCG7SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06E8))
#define OS_SRC_VADCG7SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06EC))
#define OS_SRC_VADCG8SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06F0))
#define OS_SRC_VADCG8SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06F4))
#define OS_SRC_VADCG8SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06F8))
#define OS_SRC_VADCG8SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x06FC))
#define OS_SRC_VADCG9SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0700))
#define OS_SRC_VADCG9SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0704))
#define OS_SRC_VADCG9SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0708))
#define OS_SRC_VADCG9SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x070C))
#define OS_SRC_VADCG10SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0710))
#define OS_SRC_VADCG10SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0714))
#define OS_SRC_VADCG10SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0718))
#define OS_SRC_VADCG10SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x071C))
#define OS_SRC_VADCG11SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0720))
#define OS_SRC_VADCG11SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0724))
#define OS_SRC_VADCG11SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0728))
#define OS_SRC_VADCG11SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x072C))
#define OS_SRC_VADCG12SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0730))
#define OS_SRC_VADCG13SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0734))
#define OS_SRC_VADCG14SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0738))
#define OS_SRC_VADCG15SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x073C))
#define OS_SRC_VADCG16SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0740))
#define OS_SRC_VADCG17SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0744))
#define OS_SRC_VADCG18SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0748))
#define OS_SRC_VADCG19SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x074C))
#define OS_SRC_VADCCG0SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0750))
#define OS_SRC_VADCCG0SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0754))
#define OS_SRC_VADCCG0SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0758))
#define OS_SRC_VADCCG0SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x075C))
#define OS_SRC_VADCCG1SR0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0760))
#define OS_SRC_VADCCG1SR1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0764))
#define OS_SRC_VADCCG1SR2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0768))
#define OS_SRC_VADCCG1SR3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x076C))
#define OS_SRC_DSADCSRM0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0770))
#define OS_SRC_DSADCSRM1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0778))
#define OS_SRC_DSADCSRM2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0780))
#define OS_SRC_DSADCSRM3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0788))
#define OS_SRC_DSADCSRM4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0790))
#define OS_SRC_DSADCSRM5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0798))
#define OS_SRC_DSADCSRM6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07A0))
#define OS_SRC_DSADCSRM7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07A8))
#define OS_SRC_DSADCSRM8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07B0))
#define OS_SRC_DSADCSRM9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07B8))
#define OS_SRC_DSADCSRM10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07C0))
#define OS_SRC_DSADCSRM11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07C8))
#define OS_SRC_DSADCSRM12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07D0))
#define OS_SRC_DSADCSRM13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07D8))
#define OS_SRC_DSADCSRA0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0774))
#define OS_SRC_DSADCSRA1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x077C))
#define OS_SRC_DSADCSRA2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0784))
#define OS_SRC_DSADCSRA3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x078C))
#define OS_SRC_DSADCSRA4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0794))
#define OS_SRC_DSADCSRA5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x079C))
#define OS_SRC_DSADCSRA6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07A4))
#define OS_SRC_DSADCSRA7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07AC))
#define OS_SRC_DSADCSRA8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07B4))
#define OS_SRC_DSADCSRA9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07BC))
#define OS_SRC_DSADCSRA10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07C4))
#define OS_SRC_DSADCSRA11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07CC))
#define OS_SRC_DSADCSRA12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07D4))
#define OS_SRC_DSADCSRA13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x07DC))
#define OS_SRC_ERAY0INT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0800))
#define OS_SRC_ERAY0INT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0804))
#define OS_SRC_ERAY0TINT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0808))
#define OS_SRC_ERAY0TINT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x080C))
#define OS_SRC_ERAY0NDAT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0810))
#define OS_SRC_ERAY0NDAT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0814))
#define OS_SRC_ERAY0MBSC0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0818))
#define OS_SRC_ERAY0MBSC1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x081C))
#define OS_SRC_ERAY0OBUSY (*(os_tricoresrn_t *)(OS_SRCBASE+0x0820))
#define OS_SRC_ERAY0IBUSY (*(os_tricoresrn_t *)(OS_SRCBASE+0x0824))
#define OS_SRC_ERAY1INT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0830))
#define OS_SRC_ERAY1INT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0834))
#define OS_SRC_ERAY1TINT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0838))
#define OS_SRC_ERAY1TINT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x083C))
#define OS_SRC_ERAY1NDAT0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0840))
#define OS_SRC_ERAY1NDAT1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0844))
#define OS_SRC_ERAY1MBSC0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0848))
#define OS_SRC_ERAY1MBSC1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x084C))
#define OS_SRC_ERAY1OBUSY (*(os_tricoresrn_t *)(OS_SRCBASE+0x0850))
#define OS_SRC_ERAY1IBUSY (*(os_tricoresrn_t *)(OS_SRCBASE+0x0854))
#define OS_SRC_PMUHOST (*(os_tricoresrn_t *)(OS_SRCBASE+0x0860))
#define OS_SRC_PMUFSI (*(os_tricoresrn_t *)(OS_SRCBASE+0x0864))
#define OS_SRC_HSM0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0870))
#define OS_SRC_HSM1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0874))
#define OS_SRC_SCUERU0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0880))
#define OS_SRC_SCUERU1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0884))
#define OS_SRC_SCUERU2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0888))
#define OS_SRC_SCUERU3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x088C))
#define OS_SRC_PMSDTS (*(os_tricoresrn_t *)(OS_SRCBASE+0x089C))
#define OS_SRC_PMS0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08A0))
#define OS_SRC_PMS1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08A4))
#define OS_SRC_PMS2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08A8))
#define OS_SRC_PMS3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08AC))
#define OS_SRC_SCR (*(os_tricoresrn_t *)(OS_SRCBASE+0x08B0))
#define OS_SRC_SMU0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08C0))
#define OS_SRC_SMU1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08C4))
#define OS_SRC_SMU2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08C8))
#define OS_SRC_PSI50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08D0))
#define OS_SRC_PSI51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08D4))
#define OS_SRC_PSI52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08D8))
#define OS_SRC_PSI53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08DC))
#define OS_SRC_PSI54 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08E0))
#define OS_SRC_PSI55 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08E4))
#define OS_SRC_PSI56 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08E8))
#define OS_SRC_PSI57 (*(os_tricoresrn_t *)(OS_SRCBASE+0x08EC))
#define OS_SRC_DAM0LI0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0900))
#define OS_SRC_DAM1LI0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0918))
#define OS_SRC_DAM0RI0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0904))
#define OS_SRC_DAM1RI0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x091C))
#define OS_SRC_DAM0LI1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0908))
#define OS_SRC_DAM1LI1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0920))
#define OS_SRC_DAM0RI1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x090C))
#define OS_SRC_DAM1RI1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0924))
#define OS_SRC_DAM0DR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0910))
#define OS_SRC_DAM1DR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0928))
#define OS_SRC_DAM0ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0914))
#define OS_SRC_DAM1ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x092C))
#define OS_SRC_CIFMI (*(os_tricoresrn_t *)(OS_SRCBASE+0x0930))
#define OS_SRC_CIFMIEP (*(os_tricoresrn_t *)(OS_SRCBASE+0x0934))
#define OS_SRC_CIFISP (*(os_tricoresrn_t *)(OS_SRCBASE+0x0938))
#define OS_SRC_CIFMJPEG (*(os_tricoresrn_t *)(OS_SRCBASE+0x093C))
#define OS_SRC_PSI5S0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0950))
#define OS_SRC_PSI5S1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0954))
#define OS_SRC_PSI5S2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0958))
#define OS_SRC_PSI5S3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x095C))
#define OS_SRC_PSI5S4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0960))
#define OS_SRC_PSI5S5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0964))
#define OS_SRC_PSI5S6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0968))
#define OS_SRC_PSI5S7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x096C))
#define OS_SRC_RIF0ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0970))
#define OS_SRC_RIF0INT (*(os_tricoresrn_t *)(OS_SRCBASE+0x0974))
#define OS_SRC_RIF1ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0978))
#define OS_SRC_RIF1INT (*(os_tricoresrn_t *)(OS_SRCBASE+0x097C))
#define OS_SRC_SPU0ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0980))
#define OS_SRC_SPU0INT (*(os_tricoresrn_t *)(OS_SRCBASE+0x0984))
#define OS_SRC_SPU1ERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0988))
#define OS_SRC_SPU1INT (*(os_tricoresrn_t *)(OS_SRCBASE+0x098C))
#define OS_SRC_GPSR00 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0990))
#define OS_SRC_GPSR01 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0994))
#define OS_SRC_GPSR02 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0998))
#define OS_SRC_GPSR03 (*(os_tricoresrn_t *)(OS_SRCBASE+0x099C))
#define OS_SRC_GPSR04 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09A0))
#define OS_SRC_GPSR05 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09A4))
#define OS_SRC_GPSR06 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09A8))
#define OS_SRC_GPSR07 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09AC))
#define OS_SRC_GPSR10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09B0))
#define OS_SRC_GPSR11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09B4))
#define OS_SRC_GPSR12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09B8))
#define OS_SRC_GPSR13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09BC))
#define OS_SRC_GPSR14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09C0))
#define OS_SRC_GPSR15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09C4))
#define OS_SRC_GPSR16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09C8))
#define OS_SRC_GPSR17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09CC))
#define OS_SRC_GPSR20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09D0))
#define OS_SRC_GPSR21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09D4))
#define OS_SRC_GPSR22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09D8))
#define OS_SRC_GPSR23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09DC))
#define OS_SRC_GPSR24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09E0))
#define OS_SRC_GPSR25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09E4))
#define OS_SRC_GPSR26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09E8))
#define OS_SRC_GPSR27 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09EC))
#define OS_SRC_GPSR30 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09F0))
#define OS_SRC_GPSR31 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09F4))
#define OS_SRC_GPSR32 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09F8))
#define OS_SRC_GPSR33 (*(os_tricoresrn_t *)(OS_SRCBASE+0x09FC))
#define OS_SRC_GPSR34 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A00))
#define OS_SRC_GPSR35 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A04))
#define OS_SRC_GPSR36 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A08))
#define OS_SRC_GPSR37 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A0C))
#define OS_SRC_GPSR40 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A10))
#define OS_SRC_GPSR41 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A14))
#define OS_SRC_GPSR42 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A18))
#define OS_SRC_GPSR43 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A1C))
#define OS_SRC_GPSR44 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A20))
#define OS_SRC_GPSR45 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A24))
#define OS_SRC_GPSR46 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A28))
#define OS_SRC_GPSR47 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A2C))
#define OS_SRC_GPSR50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A30))
#define OS_SRC_GPSR51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A34))
#define OS_SRC_GPSR52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A38))
#define OS_SRC_GPSR53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A3C))
#define OS_SRC_GPSR54 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A40))
#define OS_SRC_GPSR55 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A44))
#define OS_SRC_GPSR56 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A48))
#define OS_SRC_GPSR57 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A4C))
#define OS_SRC_GTMAEIIRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A70))
#define OS_SRC_GTMARUIRQ0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A74))
#define OS_SRC_GTMARUIRQ1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A78))
#define OS_SRC_GTMARUIRQ2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A7C))
#define OS_SRC_GTMBRCIRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A80))
#define OS_SRC_GTMCMPIRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A84))
#define OS_SRC_GTMSPE0IRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A88))
#define OS_SRC_GTMSPE1IRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A8C))
#define OS_SRC_GTMSPE2IRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A90))
#define OS_SRC_GTMSPE3IRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A94))
#define OS_SRC_GTMSPE4IRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A98))
#define OS_SRC_GTMSPE5IRQ (*(os_tricoresrn_t *)(OS_SRCBASE+0x0A9C))
#define OS_SRC_GTMPSM00 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AA0))
#define OS_SRC_GTMPSM01 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AA4))
#define OS_SRC_GTMPSM02 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AA8))
#define OS_SRC_GTMPSM03 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AAC))
#define OS_SRC_GTMPSM04 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AB0))
#define OS_SRC_GTMPSM05 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AB4))
#define OS_SRC_GTMPSM06 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AB8))
#define OS_SRC_GTMPSM07 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0ABC))
#define OS_SRC_GTMPSM10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AC0))
#define OS_SRC_GTMPSM11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AC4))
#define OS_SRC_GTMPSM12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AC8))
#define OS_SRC_GTMPSM13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0ACC))
#define OS_SRC_GTMPSM14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AD0))
#define OS_SRC_GTMPSM15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AD4))
#define OS_SRC_GTMPSM16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AD8))
#define OS_SRC_GTMPSM17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0ADC))
#define OS_SRC_GTMPSM20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AE0))
#define OS_SRC_GTMPSM21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AE4))
#define OS_SRC_GTMPSM22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AE8))
#define OS_SRC_GTMPSM23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AEC))
#define OS_SRC_GTMPSM24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AF0))
#define OS_SRC_GTMPSM25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AF4))
#define OS_SRC_GTMPSM26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AF8))
#define OS_SRC_GTMPSM27 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0AFC))
#define OS_SRC_GTMDPLL0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B00))
#define OS_SRC_GTMDPLL1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B04))
#define OS_SRC_GTMDPLL2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B08))
#define OS_SRC_GTMDPLL3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B0C))
#define OS_SRC_GTMDPLL4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B10))
#define OS_SRC_GTMDPLL5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B14))
#define OS_SRC_GTMDPLL6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B18))
#define OS_SRC_GTMDPLL7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B1C))
#define OS_SRC_GTMDPLL8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B20))
#define OS_SRC_GTMDPLL9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B24))
#define OS_SRC_GTMDPLL10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B28))
#define OS_SRC_GTMDPLL11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B2C))
#define OS_SRC_GTMDPLL12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B30))
#define OS_SRC_GTMDPLL13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B34))
#define OS_SRC_GTMDPLL14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B38))
#define OS_SRC_GTMDPLL15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B3C))
#define OS_SRC_GTMDPLL16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B40))
#define OS_SRC_GTMDPLL17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B44))
#define OS_SRC_GTMDPLL18 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B48))
#define OS_SRC_GTMDPLL19 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B4C))
#define OS_SRC_GTMDPLL20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B50))
#define OS_SRC_GTMDPLL21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B54))
#define OS_SRC_GTMDPLL22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B58))
#define OS_SRC_GTMDPLL23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B5C))
#define OS_SRC_GTMDPLL24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B60))
#define OS_SRC_GTMDPLL25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B64))
#define OS_SRC_GTMDPLL26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B68))
#define OS_SRC_GTMERR (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B70))
#define OS_SRC_GTMTIM00 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B90))
#define OS_SRC_GTMTIM01 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B94))
#define OS_SRC_GTMTIM02 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B98))
#define OS_SRC_GTMTIM03 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0B9C))
#define OS_SRC_GTMTIM04 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BA0))
#define OS_SRC_GTMTIM05 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BA4))
#define OS_SRC_GTMTIM06 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BA8))
#define OS_SRC_GTMTIM07 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BAC))
#define OS_SRC_GTMTIM10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BB0))
#define OS_SRC_GTMTIM11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BB4))
#define OS_SRC_GTMTIM12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BB8))
#define OS_SRC_GTMTIM13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BBC))
#define OS_SRC_GTMTIM14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BC0))
#define OS_SRC_GTMTIM15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BC4))
#define OS_SRC_GTMTIM16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BC8))
#define OS_SRC_GTMTIM17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BCC))
#define OS_SRC_GTMTIM20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BD0))
#define OS_SRC_GTMTIM21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BD4))
#define OS_SRC_GTMTIM22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BD8))
#define OS_SRC_GTMTIM23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BDC))
#define OS_SRC_GTMTIM24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BE0))
#define OS_SRC_GTMTIM25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BE4))
#define OS_SRC_GTMTIM26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BE8))
#define OS_SRC_GTMTIM27 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BEC))
#define OS_SRC_GTMTIM30 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BF0))
#define OS_SRC_GTMTIM31 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BF4))
#define OS_SRC_GTMTIM32 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BF8))
#define OS_SRC_GTMTIM33 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0BFC))
#define OS_SRC_GTMTIM34 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C00))
#define OS_SRC_GTMTIM35 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C04))
#define OS_SRC_GTMTIM36 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C08))
#define OS_SRC_GTMTIM37 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C0C))
#define OS_SRC_GTMTIM40 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C10))
#define OS_SRC_GTMTIM41 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C14))
#define OS_SRC_GTMTIM42 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C18))
#define OS_SRC_GTMTIM43 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C1C))
#define OS_SRC_GTMTIM44 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C20))
#define OS_SRC_GTMTIM45 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C24))
#define OS_SRC_GTMTIM46 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C28))
#define OS_SRC_GTMTIM47 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C2C))
#define OS_SRC_GTMTIM50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C30))
#define OS_SRC_GTMTIM51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C34))
#define OS_SRC_GTMTIM52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C38))
#define OS_SRC_GTMTIM53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C3C))
#define OS_SRC_GTMTIM54 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C40))
#define OS_SRC_GTMTIM55 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C44))
#define OS_SRC_GTMTIM56 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C48))
#define OS_SRC_GTMTIM57 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C4C))
#define OS_SRC_GTMTIM60 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C50))
#define OS_SRC_GTMTIM61 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C54))
#define OS_SRC_GTMTIM62 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C58))
#define OS_SRC_GTMTIM63 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C5C))
#define OS_SRC_GTMTIM64 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C60))
#define OS_SRC_GTMTIM65 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C64))
#define OS_SRC_GTMTIM66 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C68))
#define OS_SRC_GTMTIM67 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C6C))
#define OS_SRC_GTMTIM70 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C70))
#define OS_SRC_GTMTIM71 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C74))
#define OS_SRC_GTMTIM72 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C78))
#define OS_SRC_GTMTIM73 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C7C))
#define OS_SRC_GTMTIM74 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C80))
#define OS_SRC_GTMTIM75 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C84))
#define OS_SRC_GTMTIM76 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C88))
#define OS_SRC_GTMTIM77 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0C8C))
#define OS_SRC_GTMMCS00 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CB0))
#define OS_SRC_GTMMCS01 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CB4))
#define OS_SRC_GTMMCS02 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CB8))
