Andi-Pleian/Crash_Detection_Monitoring_Over_XCP/TC3x7_XCP/EB_Stubs/Os_tc39xx.h
#define OS_SRC_GTMMCS03 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CBC))
#define OS_SRC_GTMMCS04 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CC0))
#define OS_SRC_GTMMCS05 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CC4))
#define OS_SRC_GTMMCS06 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CC8))
#define OS_SRC_GTMMCS07 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CCC))
#define OS_SRC_GTMMCS10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CD0))
#define OS_SRC_GTMMCS11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CD4))
#define OS_SRC_GTMMCS12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CD8))
#define OS_SRC_GTMMCS13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CDC))
#define OS_SRC_GTMMCS14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CE0))
#define OS_SRC_GTMMCS15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CE4))
#define OS_SRC_GTMMCS16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CE8))
#define OS_SRC_GTMMCS17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CEC))
#define OS_SRC_GTMMCS20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CF0))
#define OS_SRC_GTMMCS21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CF4))
#define OS_SRC_GTMMCS22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CF8))
#define OS_SRC_GTMMCS23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0CFC))
#define OS_SRC_GTMMCS24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D00))
#define OS_SRC_GTMMCS25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D04))
#define OS_SRC_GTMMCS26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D08))
#define OS_SRC_GTMMCS27 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D0C))
#define OS_SRC_GTMMCS30 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D10))
#define OS_SRC_GTMMCS31 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D14))
#define OS_SRC_GTMMCS32 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D18))
#define OS_SRC_GTMMCS33 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D1C))
#define OS_SRC_GTMMCS34 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D20))
#define OS_SRC_GTMMCS35 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D24))
#define OS_SRC_GTMMCS36 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D28))
#define OS_SRC_GTMMCS37 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D2C))
#define OS_SRC_GTMMCS40 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D30))
#define OS_SRC_GTMMCS41 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D34))
#define OS_SRC_GTMMCS42 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D38))
#define OS_SRC_GTMMCS43 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D3C))
#define OS_SRC_GTMMCS44 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D40))
#define OS_SRC_GTMMCS45 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D44))
#define OS_SRC_GTMMCS46 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D48))
#define OS_SRC_GTMMCS47 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D4C))
#define OS_SRC_GTMMCS50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D50))
#define OS_SRC_GTMMCS51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D54))
#define OS_SRC_GTMMCS52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D58))
#define OS_SRC_GTMMCS53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D5C))
#define OS_SRC_GTMMCS54 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D60))
#define OS_SRC_GTMMCS55 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D64))
#define OS_SRC_GTMMCS56 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D68))
#define OS_SRC_GTMMCS57 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D6C))
#define OS_SRC_GTMMCS60 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D70))
#define OS_SRC_GTMMCS61 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D74))
#define OS_SRC_GTMMCS62 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D78))
#define OS_SRC_GTMMCS63 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D7C))
#define OS_SRC_GTMMCS64 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D80))
#define OS_SRC_GTMMCS65 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D84))
#define OS_SRC_GTMMCS66 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D88))
#define OS_SRC_GTMMCS67 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D8C))
#define OS_SRC_GTMMCS70 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D90))
#define OS_SRC_GTMMCS71 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D94))
#define OS_SRC_GTMMCS72 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D98))
#define OS_SRC_GTMMCS73 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0D9C))
#define OS_SRC_GTMMCS74 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DA0))
#define OS_SRC_GTMMCS75 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DA4))
#define OS_SRC_GTMMCS76 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DA8))
#define OS_SRC_GTMMCS77 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DAC))
#define OS_SRC_GTMMCS80 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DB0))
#define OS_SRC_GTMMCS81 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DB4))
#define OS_SRC_GTMMCS82 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DB8))
#define OS_SRC_GTMMCS83 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DBC))
#define OS_SRC_GTMMCS84 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DC0))
#define OS_SRC_GTMMCS85 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DC4))
#define OS_SRC_GTMMCS86 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DC8))
#define OS_SRC_GTMMCS87 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DCC))
#define OS_SRC_GTMMCS90 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DD0))
#define OS_SRC_GTMMCS91 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DD4))
#define OS_SRC_GTMMCS92 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DD8))
#define OS_SRC_GTMMCS93 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DDC))
#define OS_SRC_GTMMCS94 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DE0))
#define OS_SRC_GTMMCS95 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DE4))
#define OS_SRC_GTMMCS96 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DE8))
#define OS_SRC_GTMMCS97 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0DEC))
#define OS_SRC_GTMTOM00 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E10))
#define OS_SRC_GTMTOM01 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E14))
#define OS_SRC_GTMTOM02 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E18))
#define OS_SRC_GTMTOM03 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E1C))
#define OS_SRC_GTMTOM04 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E20))
#define OS_SRC_GTMTOM05 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E24))
#define OS_SRC_GTMTOM06 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E28))
#define OS_SRC_GTMTOM07 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E2C))
#define OS_SRC_GTMTOM10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E30))
#define OS_SRC_GTMTOM11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E34))
#define OS_SRC_GTMTOM12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E38))
#define OS_SRC_GTMTOM13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E3C))
#define OS_SRC_GTMTOM14 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E40))
#define OS_SRC_GTMTOM15 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E44))
#define OS_SRC_GTMTOM16 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E48))
#define OS_SRC_GTMTOM17 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E4C))
#define OS_SRC_GTMTOM20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E50))
#define OS_SRC_GTMTOM21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E54))
#define OS_SRC_GTMTOM22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E58))
#define OS_SRC_GTMTOM23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E5C))
#define OS_SRC_GTMTOM24 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E60))
#define OS_SRC_GTMTOM25 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E64))
#define OS_SRC_GTMTOM26 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E68))
#define OS_SRC_GTMTOM27 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E6C))
#define OS_SRC_GTMTOM30 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E70))
#define OS_SRC_GTMTOM31 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E74))
#define OS_SRC_GTMTOM32 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E78))
#define OS_SRC_GTMTOM33 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E7C))
#define OS_SRC_GTMTOM34 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E80))
#define OS_SRC_GTMTOM35 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E84))
#define OS_SRC_GTMTOM36 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E88))
#define OS_SRC_GTMTOM37 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E8C))
#define OS_SRC_GTMTOM40 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E90))
#define OS_SRC_GTMTOM41 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E94))
#define OS_SRC_GTMTOM42 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E98))
#define OS_SRC_GTMTOM43 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0E9C))
#define OS_SRC_GTMTOM44 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EA0))
#define OS_SRC_GTMTOM45 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EA4))
#define OS_SRC_GTMTOM46 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EA8))
#define OS_SRC_GTMTOM47 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EAC))
#define OS_SRC_GTMTOM50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EB0))
#define OS_SRC_GTMTOM51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EB4))
#define OS_SRC_GTMTOM52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EB8))
#define OS_SRC_GTMTOM53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EBC))
#define OS_SRC_GTMTOM54 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EC0))
#define OS_SRC_GTMTOM55 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EC4))
#define OS_SRC_GTMTOM56 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EC8))
#define OS_SRC_GTMTOM57 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0ECC))
#define OS_SRC_GTMATOM00 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EF0))
#define OS_SRC_GTMATOM01 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EF4))
#define OS_SRC_GTMATOM02 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EF8))
#define OS_SRC_GTMATOM03 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0EFC))
#define OS_SRC_GTMATOM10 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F00))
#define OS_SRC_GTMATOM11 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F04))
#define OS_SRC_GTMATOM12 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F08))
#define OS_SRC_GTMATOM13 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F0C))
#define OS_SRC_GTMATOM20 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F10))
#define OS_SRC_GTMATOM21 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F14))
#define OS_SRC_GTMATOM22 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F18))
#define OS_SRC_GTMATOM23 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F1C))
#define OS_SRC_GTMATOM30 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F20))
#define OS_SRC_GTMATOM31 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F24))
#define OS_SRC_GTMATOM32 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F28))
#define OS_SRC_GTMATOM33 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F2C))
#define OS_SRC_GTMATOM40 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F30))
#define OS_SRC_GTMATOM41 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F34))
#define OS_SRC_GTMATOM42 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F38))
#define OS_SRC_GTMATOM43 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F3C))
#define OS_SRC_GTMATOM50 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F40))
#define OS_SRC_GTMATOM51 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F44))
#define OS_SRC_GTMATOM52 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F48))
#define OS_SRC_GTMATOM53 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F4C))
#define OS_SRC_GTMATOM60 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F50))
#define OS_SRC_GTMATOM61 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F54))
#define OS_SRC_GTMATOM62 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F58))
#define OS_SRC_GTMATOM63 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F5C))
#define OS_SRC_GTMATOM70 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F60))
#define OS_SRC_GTMATOM71 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F64))
#define OS_SRC_GTMATOM72 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F68))
#define OS_SRC_GTMATOM73 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F6C))
#define OS_SRC_GTMATOM80 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F70))
#define OS_SRC_GTMATOM81 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F74))
#define OS_SRC_GTMATOM82 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F78))
#define OS_SRC_GTMATOM83 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F7C))
#define OS_SRC_GTMATOM90 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F80))
#define OS_SRC_GTMATOM91 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F84))
#define OS_SRC_GTMATOM92 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F88))
#define OS_SRC_GTMATOM93 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F8C))
#define OS_SRC_GTMATOM100 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F90))
#define OS_SRC_GTMATOM101 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F94))
#define OS_SRC_GTMATOM102 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F98))
#define OS_SRC_GTMATOM103 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0F9C))
#define OS_SRC_GTMATOM110 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FA0))
#define OS_SRC_GTMATOM111 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FA4))
#define OS_SRC_GTMATOM112 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FA8))
#define OS_SRC_GTMATOM113 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FAC))
#define OS_SRC_GTMMCSW0 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FD0))
#define OS_SRC_GTMMCSW1 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FD4))
#define OS_SRC_GTMMCSW2 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FD8))
#define OS_SRC_GTMMCSW3 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FDC))
#define OS_SRC_GTMMCSW4 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FE0))
#define OS_SRC_GTMMCSW5 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FE4))
#define OS_SRC_GTMMCSW6 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FE8))
#define OS_SRC_GTMMCSW7 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FEC))
#define OS_SRC_GTMMCSW8 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FF0))
#define OS_SRC_GTMMCSW9 (*(os_tricoresrn_t *)(OS_SRCBASE+0x0FF4))


/* Peripheral modules that are of interest to the OS
 *
 * The STM is the system timer module and contains the 64-bit free-running counter used for all time measurements.
 * On the TC39XX we have 6 STM modules and 2 possible interrupts per module.
 *
 * CHECK: RULE 402 OFF	(OS_pwr isn't a constant-like macro; it's a variable-like macros)
*/
#define OS_PWR_BASE		OS_U(0xf0036000)
#include <TRICORE/Os_TRICORE_pwr.h>
#define OS_pwr			(*(os_tricorepwr_t *)OS_PWR_BASE)

/* These are the system timer's (STM[0-5]) base addresses. */
#define OS_N_STM		6
#define OS_STM0_BASE	OS_U(0xf0001000)
#define OS_STM1_BASE	OS_U(0xf0001100)
#define OS_STM2_BASE	OS_U(0xf0001200)
#define OS_STM3_BASE	OS_U(0xf0001300)
#define OS_STM4_BASE	OS_U(0xf0001400)
#define OS_STM5_BASE	OS_U(0xf0001500)

/* STM0 is the default system timer. */
#define OS_STM_BASE OS_STM0_BASE

#define OS_STM_HAS_COMPARE	1

/* OCDS Control and Status Register (OCS) */
#define OS_STM_OCS_OFFSET	0xe8
#define OS_STM0_OCS			(*(os_reg32_t *)(OS_STM0_BASE+OS_STM_OCS_OFFSET))
#define OS_STM1_OCS			(*(os_reg32_t *)(OS_STM1_BASE+OS_STM_OCS_OFFSET))
#define OS_STM2_OCS			(*(os_reg32_t *)(OS_STM2_BASE+OS_STM_OCS_OFFSET))
#define OS_STM3_OCS			(*(os_reg32_t *)(OS_STM3_BASE+OS_STM_OCS_OFFSET))
#define OS_STM4_OCS			(*(os_reg32_t *)(OS_STM4_BASE+OS_STM_OCS_OFFSET))
#define OS_STM5_OCS			(*(os_reg32_t *)(OS_STM5_BASE+OS_STM_OCS_OFFSET))

#endif
/* Editor settings; DO NOT DELETE
 * vi:set ts=4:
*/
